---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
source: html/9dd7de79-5e37-b70e-8736-2656a9febf50.htm
---
# VertexStreamPositionNormalColored Members

Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.